Unix/tests/protocol/posthttp/test1.request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd">
  <s:Header>
    <a:To>https://157.59.84.237:7779/wsman</a:To>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/*</w:ResourceURI>
    <a:ReplyTo>
      <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
    <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
    <a:MessageID>uuid:2CE8AD2B-8EA5-4FA8-A11C-A4C335FE9AAC</a:MessageID>
    <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
    <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
    <p:ActivityId s:mustUnderstand="false">DEE76A48-606F-0002-C1FE-E7DE6F60CD01</p:ActivityId>
    <p:SessionId s:mustUnderstand="false">uuid:FBE877C9-8E74-4EDC-BF2F-C23320076D64</p:SessionId>
    <p:OperationID s:mustUnderstand="false">uuid:0DD36AEA-EB4A-4D88-9EE5-928CB0A5E911</p:OperationID>
    <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
    <w:SelectorSet>
      <w:Selector Name="__cimnamespace">root/OMI</w:Selector>
    </w:SelectorSet>
    <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option>
    </w:OptionSet>
  </s:Header>
  <s:Body>
    <n:Enumerate>
      <w:OptimizeEnumeration/>
      <w:MaxElements>32000</w:MaxElements>
      <w:EnumerationMode>EnumerateObjectAndEPR</w:EnumerationMode>
      <w:Filter Dialect="http://schemas.microsoft.com/wbem/wsman/1/WQL">select * from OMI_Identify</w:Filter>
    </n:Enumerate>
  </s:Body>
</s:Envelope>
